import { Box } from "@mui/material";
import {
  Heading,
  CarouselComponent,
} from "../../ReUseableComponent/AllReuseableComponent";
/////////////////////////////////////////////////////////////////////
const editorialItems = [
  {
    id: "1",
    title: "مرحله‌ی جدیدی از طرح احیای چاه‌های کم‌بازده اجرا می‌شود",
    description:
      "رئیس پارک فناوری و نوآوری نفت و گاز از اجرای فاز جدید طرح احیای چاه‌های کم‌بازده در چهار میدان نفتی مناطق نفت‌خیز جنوب با حضور شرکت‌های دانش‌بنیان خبر داد.",
    src: "./src/assets/images/editorial-1.png",
  },
  {
    id: "2",
    title: "مرحله‌ی جدیدی از طرح احیای چاه‌های کم‌بازده اجرا می‌شود",
    description:
      "رئیس پارک فناوری و نوآوری نفت و گاز از اجرای فاز جدید طرح احیای چاه‌های کم‌بازده در چهار میدان نفتی مناطق نفت‌خیز جنوب با حضور شرکت‌های دانش‌بنیان خبر داد.",
    src: "./src/assets/images/editorial-1.png",
  },
  {
    id: "3",
    title: "مرحله‌ی جدیدی از طرح احیای چاه‌های کم‌بازده اجرا می‌شود",
    description:
      "رئیس پارک فناوری و نوآوری نفت و گاز از اجرای فاز جدید طرح احیای چاه‌های کم‌بازده در چهار میدان نفتی مناطق نفت‌خیز جنوب با حضور شرکت‌های دانش‌بنیان خبر داد.",
    src: "./src/assets/images/editorial-1.png",
  },
  {
    id: "4",
    title: "مرحله‌ی جدیدی از طرح احیای چاه‌های کم‌بازده اجرا می‌شود",
    description:
      "رئیس پارک فناوری و نوآوری نفت و گاز از اجرای فاز جدید طرح احیای چاه‌های کم‌بازده در چهار میدان نفتی مناطق نفت‌خیز جنوب با حضور شرکت‌های دانش‌بنیان خبر داد.",
    src: "./src/assets/images/editorial-1.png",
  },
];
/////////////////////////////////////////////////////////////////////
const Editorial = () => {
  return (
    <>
      <Heading title="سرمقاله" />
      <Box sx={{ padding: "16px 0" }}>
        <CarouselComponent data={editorialItems} />
      </Box>
    </>
  );
};
export default Editorial;
